stm32-hotspot/STM32WBA55_BLE_P2PClient_EXT_ATT/STM32_WPAN/App/gatt_client_app.c
  return status;
}

/* USER CODE BEGIN FD */

/* USER CODE END FD */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

/**
 * @brief  Event handler
 * @param  Event: Address of the buffer holding the Event
 * @retval Ack: Return whether the Event has been managed or not
 */
static SVCCTL_EvtAckStatus_t Event_Handler(void *Event)
{
  SVCCTL_EvtAckStatus_t return_value;
  hci_event_pckt *event_pckt;
  evt_blecore_aci *p_blecore_evt;

  GATT_CLIENT_APP_Notification_evt_t Notification;
  UNUSED(Notification);

  return_value = SVCCTL_EvtNotAck;
  event_pckt = (hci_event_pckt *)(((hci_uart_pckt*)Event)->data);

  switch (event_pckt->evt)
  {
    case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
    {
      p_blecore_evt = (evt_blecore_aci*)event_pckt->data;
      switch (p_blecore_evt->ecode)
      {
        case ACI_ATT_READ_BY_GROUP_TYPE_RESP_VSEVT_CODE:
        {
          aci_att_read_by_group_type_resp_event_rp0 *p_evt_rsp = (void*)p_blecore_evt->data;
          gatt_parse_services((aci_att_read_by_group_type_resp_event_rp0 *)p_evt_rsp);
        }
        break; /* ACI_ATT_READ_BY_GROUP_TYPE_RESP_VSEVT_CODE */
        case ACI_ATT_FIND_BY_TYPE_VALUE_RESP_VSEVT_CODE:
        {
          aci_att_find_by_type_value_resp_event_rp0 *p_evt_rsp = (void*) p_blecore_evt->data;
          gatt_parse_services_by_UUID((aci_att_find_by_type_value_resp_event_rp0 *)p_evt_rsp);
        }
        break; /* ACI_ATT_FIND_BY_TYPE_VALUE_RESP_VSEVT_CODE */
        case ACI_ATT_READ_BY_TYPE_RESP_VSEVT_CODE:
        {
          aci_att_read_by_type_resp_event_rp0 *p_evt_rsp = (void*)p_blecore_evt->data;
          gatt_parse_chars((aci_att_read_by_type_resp_event_rp0 *)p_evt_rsp);
        }
        break; /* ACI_ATT_READ_BY_TYPE_RESP_VSEVT_CODE */
        case ACI_ATT_FIND_INFO_RESP_VSEVT_CODE:
        {
          aci_att_find_info_resp_event_rp0 *p_evt_rsp = (void*)p_blecore_evt->data;
          gatt_parse_descs((aci_att_find_info_resp_event_rp0 *)p_evt_rsp);
        }
        break; /* ACI_ATT_FIND_INFO_RESP_VSEVT_CODE */
        case ACI_GATT_NOTIFICATION_VSEVT_CODE:
        {
          aci_gatt_notification_event_rp0 *p_evt_rsp = (void*)p_blecore_evt->data;
          gatt_parse_notification((aci_gatt_notification_event_rp0 *)p_evt_rsp);
        }
        break; /* ACI_GATT_NOTIFICATION_VSEVT_CODE */
        case ACI_GATT_NOTIFICATION_EXT_VSEVT_CODE:
        {
          aci_gatt_notification_ext_event_rp0 *p_evt_rsp = (void*)p_blecore_evt->data;
          gatt_parse_notification_ext((aci_gatt_notification_ext_event_rp0 *)p_evt_rsp);
        }
        break; /* ACI_GATT_NOTIFICATION_EXT_VSEVT_CODE */
        case ACI_GATT_PROC_COMPLETE_VSEVT_CODE:
        {
          aci_gatt_proc_complete_event_rp0 *p_evt_rsp = (void*)p_blecore_evt->data;

          uint8_t index;
          for (index = 0 ; index < BLE_CFG_CLT_MAX_NBR_CB ; index++)
          {
            if (a_ClientContext[index].connHdl == p_evt_rsp->Connection_Handle)
            {
              gatt_cmd_resp_release();
              break;
            }
          }
        }
        break;/* ACI_GATT_PROC_COMPLETE_VSEVT_CODE */
        case ACI_GATT_TX_POOL_AVAILABLE_VSEVT_CODE:
        {
          aci_att_exchange_mtu_resp_event_rp0 *tx_pool_available;
          tx_pool_available = (aci_att_exchange_mtu_resp_event_rp0 *)p_blecore_evt->data;
          UNUSED(tx_pool_available);
          /* USER CODE BEGIN ACI_GATT_TX_POOL_AVAILABLE_VSEVT_CODE */

          /* USER CODE END ACI_GATT_TX_POOL_AVAILABLE_VSEVT_CODE */
        }
        break;/* ACI_GATT_TX_POOL_AVAILABLE_VSEVT_CODE*/
        case ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE:
        {
          aci_att_exchange_mtu_resp_event_rp0 * exchange_mtu_resp;
          exchange_mtu_resp = (aci_att_exchange_mtu_resp_event_rp0 *)p_blecore_evt->data;
          LOG_INFO_APP("  MTU exchanged size = %d\n",exchange_mtu_resp->Server_RX_MTU );
          UNUSED(exchange_mtu_resp);
          /* USER CODE BEGIN ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE */
          tBleStatus ret = hci_le_set_data_length(exchange_mtu_resp->Connection_Handle,251,2120);
          if (ret != BLE_STATUS_SUCCESS)
          {
            LOG_INFO_APP("  Fail   : hci_le_set_data_length command, result: 0x%x \n\r", ret);
          }
          else
          {
            LOG_INFO_APP("  Success: hci_le_set_data_length command\n\r");
          }
          /* USER CODE END ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE */
        }
        break;
        case ACI_ATT_PREPARE_WRITE_RESP_VSEVT_CODE:
        {
          LOG_INFO_APP("-- GATT : ACI_ATT_PREPARE_WRITE_RESP_VSEVT_CODE \n");
          UTIL_SEQ_SetEvt(1<< CFG_PREPARE_WRITE_EVT_RSP_ID);
        }
        break; /* ACI_ATT_PREPARE_WRITE_RESP_VSEVT_CODE */
        case ACI_ATT_EXEC_WRITE_RESP_VSEVT_CODE:
        {
          LOG_INFO_APP("-- GATT : ACI_ATT_EXEC_WRITE_RESP_VSEVT_CODE \n");
          UTIL_SEQ_SetEvt(1<< CFG_EXECUTE_WRITE_EVT_RSP_ID);
        }
        break; /* ACI_ATT_EXEC_WRITE_RESP_VSEVT_CODE */
        case ACI_ATT_READ_RESP_VSEVT_CODE:
        {
          aci_att_read_resp_event_rp0 *read_resp;
          read_resp = (aci_att_read_resp_event_rp0 *)p_blecore_evt->data;
          LOG_INFO_APP("-- P2P APPLICATION CLIENT : READ RESPONSE RECEIVED\r\n");
          LOG_INFO_APP("** Read Data (Length: %d): 0x", read_resp->Event_Data_Length);
          for (uint8_t i = 0; i < read_resp->Event_Data_Length; i++)
          {
            LOG_INFO_APP("%02X ", read_resp->Attribute_Value[i]);
          }
          LOG_INFO_APP("\n\n");
        }
        break; /* ACI_ATT_READ_RESP_VSEVT_CODE */
        case ACI_GATT_READ_EXT_VSEVT_CODE:
        {
          aci_gatt_read_ext_event_rp0 *read_ext;
          read_ext = (aci_gatt_read_ext_event_rp0 *)p_blecore_evt->data;
          LOG_INFO_APP("-- P2P APPLICATION CLIENT : EXTENDED READ RESPONSE RECEIVED\r\n");
          LOG_INFO_APP("** Extended Read Data (Length: %d | Offset: %x): 0x", read_ext->Event_Data_Length, read_ext->Offset);
          for (uint8_t i = 0; i < read_ext->Event_Data_Length; i++)
          {
            LOG_INFO_APP("%02X ", read_ext->Attribute_Value[i]);
          }
          LOG_INFO_APP("\n\n");
        }
        break; /* ACI_GATT_READ_EXT_VSEVT_CODE */
        default:
          break;
      }/* end switch (p_blecore_evt->ecode) */
    }
    break; /* HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */
    default:
      break;
  }/* end switch (event_pckt->evt) */

  return(return_value);
}

__USED static void gatt_Notification(GATT_CLIENT_APP_Notification_evt_t *p_Notif)
{
  /* USER CODE BEGIN gatt_Notification_1*/

