stm32-hotspot/STM32WBA55_BLE_P2PClient_EXT_ATT/STM32_WPAN/App/gatt_client_app.c
static void gatt_parse_notification(aci_gatt_notification_event_rp0 *p_evt)
{
  LOG_INFO_APP("ACI_GATT_NOTIFICATION_VSEVT_CODE - ConnHdl=0x%04X, Attribute_Handle=0x%04X\n",
                p_evt->Connection_Handle,
                p_evt->Attribute_Handle);
/* USER CODE BEGIN gatt_parse_notification_1 */
  GATT_CLIENT_APP_Notification_evt_t Notification;
  uint8_t index;

  for (index = 0 ; index < BLE_CFG_CLT_MAX_NBR_CB ; index++)
  {
    if (a_ClientContext[index].connHdl == p_evt->Connection_Handle)
    {
      break;
    }
  }

  /* index < BLE_CFG_CLT_MAX_NBR_CB means connection handle identified */
  if (index < BLE_CFG_CLT_MAX_NBR_CB)
  {
    if (p_evt->Attribute_Handle == a_ClientContext[index].P2PNotificationValueHdl)
    {
      LOG_INFO_APP("  Incoming Nofification received P2P Server information\n");
      Notification.Client_Evt_Opcode = P2P_NOTIFICATION_INFO_RECEIVED_EVT;
      Notification.DataTransfered.length = p_evt->Attribute_Value_Length;
      Notification.DataTransfered.p_Payload = &p_evt->Attribute_Value[0];

      gatt_Notification(&Notification);
    }
  }
  else
  {
    LOG_INFO_APP("ACI_GATT_NOTIFICATION_VSEVT_CODE, failed handle not found in connection table !\n");
  }
/* USER CODE END gatt_parse_notification_1 */

  return;
}

static void client_discover_all(void)
{
  uint8_t index = 0;
  /* USER CODE BEGIN client_discover_1 */

  /* USER CODE END client_discover_1 */

  GATT_CLIENT_APP_Discover_services(index);

  /* USER CODE BEGIN client_discover_2 */

  /* USER CODE END client_discover_2 */
  return;
}

static void gatt_cmd_resp_release(void)
{
  UTIL_SEQ_SetEvt(1U << CFG_IDLEEVT_PROC_GATT_COMPLETE);
  return;
}

static void gatt_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1U << CFG_IDLEEVT_PROC_GATT_COMPLETE);
  return;
}

/* USER CODE BEGIN LF */
static void gatt_parse_notification_ext(aci_gatt_notification_ext_event_rp0 *p_evt)
{
  LOG_INFO_APP("ACI_GATT_NOTIFICATION_EXT_VSEVT_CODE - ConnHdl=0x%04X, Attribute_Handle=0x%04X\n",
                p_evt->Connection_Handle,
                p_evt->Attribute_Handle);
  
  GATT_CLIENT_APP_Notification_evt_t Notification;
  uint8_t index;

  for (index = 0 ; index < BLE_CFG_CLT_MAX_NBR_CB ; index++)
  {
    if (a_ClientContext[index].connHdl == p_evt->Connection_Handle)
    {
      break;
    }
  }

  if (a_ClientContext[index].connHdl == p_evt->Connection_Handle)
  {
    if (p_evt->Attribute_Handle == a_ClientContext[index].P2PNotificationValueHdl)
    {
      LOG_INFO_APP("  Incoming Nofification received P2P Server information\n");
      Notification.Client_Evt_Opcode = P2P_NOTIFICATION_INFO_RECEIVED_EVT;
      Notification.DataTransfered.length = p_evt->Attribute_Value_Length;
      Notification.DataTransfered.p_Payload = &p_evt->Attribute_Value[0];
      
      gatt_Notification(&Notification);
    }
  }
  else
  {
    LOG_INFO_APP("ACI_GATT_NOTIFICATION_EXT_VSEVT_CODE, failed handle not found in connection table !\n");
  }

  return;
}

static void P2Pclient_write_char(void)
{
  uint8_t index = 0;
  tBleStatus ret;

  if (P2PButtonData.level == 0x00)
  {
    P2PButtonData.level = 0x01;
  }
  else
  {
    P2PButtonData.level = 0x00;
  }

  for(index = 0; index < BLE_CFG_CLT_MAX_NBR_CB; index++)
  {
    if (a_ClientContext[index].state != GATT_CLIENT_APP_IDLE)
    {
      ret = aci_gatt_write_without_resp(a_ClientContext[index].connHdl,
                                        a_ClientContext[index].P2PWriteToServerValueHdl,
                                        2,
                                        (uint8_t *)&P2PButtonData);

      if (ret != BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("aci_gatt_write_without_resp failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                a_ClientContext[index].connHdl,
                a_ClientContext[index].P2PWriteToServerValueHdl);
      }
      else
      {
        LOG_INFO_APP("aci_gatt_write_without_resp success, connHdl=0x%04X, ValueHdl=0x%04X\n",
          a_ClientContext[index].connHdl,
          a_ClientContext[index].P2PWriteToServerValueHdl);
      }
    }
  }

  return;
}

static void P2Pclient_write_char_ext(void)
{
  uint8_t index = 0;
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  
  uint8_t payload[509];
  uint16_t length = 509;
  
  for (uint16_t i = 0; i < length; i++)
  {
    if (i < 254)
    {
      payload[i] = i + 1;
    }
    else
    {
      payload[i] = 0x0A;
    }
  }

  for(index = 0; index < BLE_CFG_CLT_MAX_NBR_CB; index++)
  {
    if (a_ClientContext[index].state != GATT_CLIENT_APP_IDLE)
    {
      ret = aci_att_prepare_write_req(a_ClientContext[index].connHdl,a_ClientContext[index].P2PWriteToServerValueHdl,0,242,(uint8_t *)  payload);
      LOG_INFO_APP("aci_att_prepare_write_req : %x\n", ret);
      UTIL_SEQ_WaitEvt(1<< CFG_PREPARE_WRITE_EVT_RSP_ID);
      
      ret = aci_att_prepare_write_req(a_ClientContext[index].connHdl,a_ClientContext[index].P2PWriteToServerValueHdl,242,242,(uint8_t *)  payload+242);
      LOG_INFO_APP("aci_att_prepare_write_req : %x\n", ret);
      UTIL_SEQ_WaitEvt(1<< CFG_PREPARE_WRITE_EVT_RSP_ID);
      
      ret = aci_att_prepare_write_req(a_ClientContext[index].connHdl,a_ClientContext[index].P2PWriteToServerValueHdl,484,25,(uint8_t *)  payload+484);
      LOG_INFO_APP("aci_att_prepare_write_req : %x\n", ret);
      UTIL_SEQ_WaitEvt(1<< CFG_PREPARE_WRITE_EVT_RSP_ID);
      
      ret = aci_att_execute_write_req(a_ClientContext[index].connHdl,0x01);
      LOG_INFO_APP("aci_att_execute_write_req : %x\n", ret);
      UTIL_SEQ_WaitEvt(1<< CFG_EXECUTE_WRITE_EVT_RSP_ID);
    }
  }

  return;
}

static void P2Pclient_read_char_ext(void)
{
  uint8_t index = 0;
  tBleStatus ret;
  
  for(index = 0; index < BLE_CFG_CLT_MAX_NBR_CB; index++)
  {
    if (a_ClientContext[index].state != GATT_CLIENT_APP_IDLE)
    {
      ret = aci_gatt_read_char_value(a_ClientContext[index].connHdl, a_ClientContext[index].P2PWriteToServerValueHdl);
      
      if (ret != BLE_STATUS_SUCCESS)
      {
        LOG_INFO_APP("aci_gatt_read_char_value failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                a_ClientContext[index].connHdl,
                a_ClientContext[index].P2PWriteToServerValueHdl);
      }
      else
      {
        gatt_cmd_resp_wait();
        LOG_INFO_APP("aci_gatt_read_char_value success, connHdl=0x%04X, ValueHdl=0x%04X\n",
          a_ClientContext[index].connHdl,
          a_ClientContext[index].P2PWriteToServerValueHdl);
      }
    }
  }
  
  return;
}
/* USER CODE END LF */
